In [4]:
import pandas as pd

显示当前版本信息

In [2]:
pd.show_versions()

INSTALLED VERSIONS
------------------
commit                : 0691c5cf90477d3503834d983f69350f250a6ff7
python                : 3.12.7
python-bits           : 64
OS                    : Windows
OS-release            : 11
Version               : 10.0.22631
machine               : AMD64
processor             : Intel64 Family 6 Model 183 Stepping 1, GenuineIntel
byteorder             : little
LC_ALL                : None
LANG                  : None
LOCALE                : Chinese (Simplified)_China.936

pandas                : 2.2.3
numpy                 : 1.26.4
pytz                  : 2024.1
dateutil              : 2.9.0
pip                   : 24.2
Cython                : None
sphinx                : None
IPython               : 8.27.0
adbc-driver-postgresql: None
adbc-driver-sqlite    : None
bs4                   : None
blosc                 : None
bottleneck            : None
dataframe-api-compat  : None
fastparquet           : None
fsspec                : None
html5lib              : None
hypothesis            : None
gcsfs                 : None
jinja2                : 3.1.4
lxml.etree            : None
matplotlib            : 3.9.1
numba                 : None
numexpr               : None
odfpy                 : None
openpyxl              : None
pandas_gbq            : None
psycopg2              : None
pymysql               : None
pyarrow               : None
pyreadstat            : None
pytest                : None
python-calamine       : None
pyxlsb                : None
s3fs                  : None
scipy                 : 1.14.1
sqlalchemy            : None
tables                : None
tabulate              : None
xarray                : None
xlrd                  : None
xlsxwriter            : None
zstandard             : 0.23.0
tzdata                : 2024.2
qtpy                  : None
pyqt5                 : None

In [3]:
import numpy as np
data = {'animal': ['cat', 'cat', 'snake', 'dog', 'dog', 'cat', 'snake', 'cat', 'dog', 'dog'],
        'age': [2.5, 3, 0.5, np.nan, 5, 2, 4.5, np.nan, 7, 3],
        'visits': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

创建一个DataFrame

In [5]:
df = pd.DataFrame(data, index=labels, columns=['animal', 'age', 'visits', 'priority'])
df.head()

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no

显示详细信息

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 10 entries, a to j
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   animal    10 non-null     object
 1   age       8 non-null      float64
 2   visits    10 non-null     int64
 3   priority  10 non-null     object
dtypes: float64(1), int64(1), object(2)
memory usage: 400.0+ bytes

索引

In [15]:
df.loc[['a','b'],'animal']

a    cat
b    cat
Name: animal, dtype: object

In [7]:
df.iloc[:3]

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no

指定选择数据范围

In [16]:
df[df['visits'] > 2]

  animal  age  visits priority
b    cat  3.0       3      yes
d    dog  NaN       3      yes
f    cat  2.0       3       no

查看缺失值

In [17]:
df[df['age'].isnull()]

  animal  age  visits priority
d    dog  NaN       3      yes
h    cat  NaN       1      yes

In [19]:
df[df.isnull().values==True] # 找到有缺失值的行

  animal  age  visits priority
d    dog  NaN       3      yes
h    cat  NaN       1      yes

通过给定范围查找某一属性

In [20]:
df[(df['animal'] =='cat') & (df['age'] < 3)]

  animal  age  visits priority
a    cat  2.5       1      yes
f    cat  2.0       3       no

改变数值

In [21]:
df.loc['f','age'] = 1.5

In [22]:
df[(df['animal'] =='cat') & (df['age'] < 3)]

  animal  age  visits priority
a    cat  2.5       1      yes
f    cat  1.5       3       no

groupby求均值

In [23]:
df.groupby('animal')['age'].mean()

animal
cat      2.333333
dog      5.000000
snake    2.500000
Name: age, dtype: float64

计算相同属性值的个数

In [24]:
df['animal'].value_counts()

animal
cat      4
dog      4
snake    2
Name: count, dtype: int64

属性值进行映射 .map

In [25]:
df['priority'] = df['priority'].map({'yes':True,'no':False})

In [26]:
df.head()

  animal  age  visits  priority
a    cat  2.5       1      True
b    cat  3.0       3      True
c  snake  0.5       2     False
d    dog  NaN       3      True
e    dog  5.0       2     False

属性值进行替换 replace

In [27]:
df['animal'] = df['animal'].replace('snake','tangyudi')
df.head()

     animal  age  visits  priority
a       cat  2.5       1      True
b       cat  3.0       3      True
c  tangyudi  0.5       2     False
d       dog  NaN       3      True
e       dog  5.0       2     False

数据透视表 pivot_table

In [28]:
df.pivot_table(index = 'animal',columns = 'visits',values='age',aggfunc = 'mean')

visits      1    2     3
animal
cat       2.5  NaN  2.25
dog       3.0  6.0   NaN
tangyudi  4.5  0.5   NaN

提取均值组成新的数据

In [29]:
df = pd.DataFrame(np.random.random(size = (5,3)))
df.head()

          0         1         2
0  0.308149  0.328718  0.686982
1  0.248149  0.850889  0.022846
2  0.825545  0.732342  0.609082
3  0.043911  0.095878  0.189168
4  0.958106  0.910724  0.959364

In [31]:
# sub() 函数用于求两个 DataFrame 相减
df.sub(df.mean(axis = 1),axis = 0) # 减去行均值的目的是为了使得每一行的均值为0

          0         1         2
0 -0.133134 -0.112566  0.245699
1 -0.125812  0.476928 -0.351115
2  0.103222  0.010019 -0.113241
3 -0.065741 -0.013774  0.079515
4  0.015374 -0.032007  0.016633

统计不同属性值的个数

In [38]:
# df.duplicated() 返回一个布尔型 Series，表示各行是否重复行(前面出现过的行)
len(df) - df.duplicated(keep=False).sum() 
# keep = False 表示所有重复的行都标记为 True ，包括第一次出现的行 
# 'first'表示第一次出现的行不标记为重复， 'last'表示最后一次出现的行不标记为重复

5

In [39]:
len(df.drop_duplicates(keep=False)) # 删除所有重复行

5

给定数据，分别求滑动窗口的均值（加入补0操作）

In [5]:
import numpy as np
df = pd.DataFrame({'group': list('aabbabbbabab'),
                       'value': [1, 2, 3, np.nan, 2, 3, 
                                 np.nan, 1, 7, 3, np.nan, 8]})

In [6]:
df.head(12)

   group  value
0      a    1.0
1      a    2.0
2      b    3.0
3      b    NaN
4      a    2.0
5      b    3.0
6      b    NaN
7      b    1.0
8      a    7.0
9      b    3.0
10     a    NaN
11     b    8.0

In [11]:
# 计算滚动平均值 (moving average) 来填充缺失值
g1 = df.groupby(['group'])['value'] # 按照 group 列分组，计算 value 列的统计量
g2 = df.fillna(0).groupby(['group'])['value'] # 用 0 填充缺失值

# 打印 g2
print("\ng2:")
for name, group in g2:
    print(name)
    print(group)

# 用平均值填充缺失值, rolling(3,min_periods=1).mean() 得到每3个数的均值，用这个均值填充缺失值
s = g2.rolling(3,min_periods=1).sum()/g2.rolling(3,min_periods=1).count() # 计算滑动窗口为 3 的均值 rolling是一个滑动函数, min_periods=1 表示窗口最小为1, rolling(3)表示窗口大小为3
print(f's:\n{s}\n')

'''
让我们逐步计算每个组的滚动平均值：

组 'a'
索引 0: (1.0) / 1 = 1.0
索引 1: (1.0 + 2.0) / 2 = 1.5
索引 4: (1.0 + 2.0 + 2.0) / 3 = 1.6667
索引 8: (2.0 + 2.0 + 7.0) / 3 = 3.6667
索引 10: (2.0 + 7.0 + 0.0) / 3 = 3.0
组 'b'
索引 2: (3.0) / 1 = 3.0
索引 3: (3.0 + 0.0) / 2 = 1.5
索引 5: (3.0 + 0.0 + 3.0) / 3 = 2.0
索引 6: (0.0 + 3.0 + 0.0) / 3 = 1.0
索引 7: (3.0 + 0.0 + 1.0) / 3 = 1.3333
索引 9: (0.0 + 1.0 + 3.0) / 3 = 1.3333
索引 11: (1.0 + 3.0 + 8.0) / 3 = 4.0
'''
s.reset_index(level = 0,drop=True).sort_index() # 重置索引并排序

g2:
('a',)
0     1.0
1     2.0
4     2.0
8     7.0
10    0.0
Name: value, dtype: float64
('b',)
2     3.0
3     0.0
5     3.0
6     0.0
7     1.0
9     3.0
11    8.0
Name: value, dtype: float64
s:
group
a      0     1.000000
       1     1.500000
       4     1.666667
       8     3.666667
       10    3.000000
b      2     3.000000
       3     1.500000
       5     2.000000
       6     1.000000
       7     1.333333
       9     1.333333
       11    4.000000
Name: value, dtype: float64

0     1.000000
1     1.500000
2     3.000000
3     1.500000
4     1.666667
5     2.000000
6     1.000000
7     1.333333
8     3.666667
9     1.333333
10    3.000000
11    4.000000
Name: value, dtype: float64

指定时间序列进行计算

In [48]:
dt = pd.date_range(start = '2017-01-01',end = '2017-12-31',freq = 'D')
s = pd.Series(np.random.rand(len(dt)),index = dt)
s[:5]

2017-01-01    0.542520
2017-01-02    0.353947
2017-01-03    0.598176
2017-01-04    0.422838
2017-01-05    0.938053
Freq: D, dtype: float64

In [49]:
s[s.index.weekday == 2].sum() # 计算周三的和

24.36218140977784

重采样

In [50]:
s.resample('ME').mean()

2017-01-31    0.559117
2017-02-28    0.441646
2017-03-31    0.427700
2017-04-30    0.476812
2017-05-31    0.508083
2017-06-30    0.447216
2017-07-31    0.502842
2017-08-31    0.418090
2017-09-30    0.504993
2017-10-31    0.515906
2017-11-30    0.434998
2017-12-31    0.483841
Freq: ME, dtype: float64

对缺失值数据自动计算

In [51]:
import pandas as pd
import numpy as np
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN', 'londON_StockhOlm', 
                               'Budapest_PaRis', 'Brussels_londOn'],
              'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
              'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
                   'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )', 
                               '12. Air France', '"Swiss Air"']})
df.head()

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [52]:
df['FlightNumber'] = df['FlightNumber'].interpolate().astype(int) # 插值填充缺失值 .interpolate()函数用于插值填充缺失值

In [34]:
df.head()

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris         10045      [23, 47]               KLM(!)
1      MAdrid_miLAN         10055            []    <Air France> (12)
2  londON_StockhOlm         10065  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis         10075          [13]       12. Air France
4   Brussels_londOn         10085      [67, 32]          "Swiss Air"

将from to 这列展开成两个特征

In [35]:
temp = df.From_To.str.split('_',expand = True) # .str.split()函数用于分割字符串
temp.columns = ['From','To'] # 重命名列名

temp['From'] = temp['From'].str.capitalize()
temp['To'] = temp['To'].str.capitalize()

In [53]:
df = df.join(temp)
df.head()

,From_To,FlightNumber,RecentDelays,Airline,From,To
0,LoNDon_paris,10045,"[23, 47]",KLM(!),London,Paris
1,MAdrid_miLAN,10055,[],<Air France> (12),Madrid,Milan
2,londON_StockhOlm,10065,"[24, 43, 87]",(British Airways. ),London,Stockholm
3,Budapest_PaRis,10075,[13],12. Air France,Budapest,Paris
4,Brussels_londOn,10085,"[67, 32]","""Swiss Air""",Brussels,London

In [54]:
df = df.drop('From_To',axis = 1)
df.head()

   FlightNumber  RecentDelays              Airline      From         To
0         10045      [23, 47]               KLM(!)    London      Paris
1         10055            []    <Air France> (12)    Madrid      Milan
2         10065  [24, 43, 87]  (British Airways. )    London  Stockholm
3         10075          [13]       12. Air France  Budapest      Paris
4         10085      [67, 32]          "Swiss Air"  Brussels     London

首字母大写，其他小写

删除from to这列，并加入temp这列

去掉airline中多余的字符

In [56]:
# .str.extract()函数用于提取字符串中的字母和空格 '([a-zA-Z\s]+)'表示提取字母和空格 expand = False 表示不展开为DataFrame
df['Airline'] = df['Airline'].str.extract(r'([a-zA-Z\s]+)', expand=False).str.strip()
df.head()

   FlightNumber  RecentDelays          Airline      From         To
0         10045      [23, 47]              KLM    London      Paris
1         10055            []       Air France    Madrid      Milan
2         10065  [24, 43, 87]  British Airways    London  Stockholm
3         10075          [13]       Air France  Budapest      Paris
4         10085      [67, 32]        Swiss Air  Brussels     London

将RecentDelays中的数据分开写

In [58]:
delays = df['RecentDelays'].apply(pd.Series) # .apply(pd.Series))函数用于将列表转换为DataFrame
delays.columns = ['delay_{}'.format(n) for n in range(1,len(delays.columns)+1)] # 重命名列名。 range不包含停止值，就需要将停止值设为 len(delays.columns) + 1。
delays

   delay_1  delay_2  delay_3
0     23.0     47.0      NaN
1      NaN      NaN      NaN
2     24.0     43.0     87.0
3     13.0      NaN      NaN
4     67.0     32.0      NaN

多重索引

In [59]:
letters = ['A','B','C']
numbers = list(range(10))
mi = pd.MultiIndex.from_product([letters,numbers])
s = pd.Series(np.random.rand(30),index=mi)
s

A  0    0.573873
   1    0.278328
   2    0.826619
   3    0.442468
   4    0.247764
   5    0.130689
   6    0.252911
   7    0.825639
   8    0.433484
   9    0.557887
B  0    0.500885
   1    0.941853
   2    0.785805
   3    0.525425
   4    0.254143
   5    0.493856
   6    0.870958
   7    0.129079
   8    0.924752
   9    0.843222
C  0    0.202455
   1    0.630107
   2    0.849590
   3    0.736269
   4    0.949112
   5    0.636009
   6    0.077862
   7    0.070303
   8    0.221734
   9    0.832908
dtype: float64

定位数据

In [63]:
s.loc[pd.IndexSlice[:'B',5:]]

A  5    0.130689
   6    0.252911
   7    0.825639
   8    0.433484
   9    0.557887
B  5    0.493856
   6    0.870958
   7    0.129079
   8    0.924752
   9    0.843222
dtype: float64

按索引计算

In [74]:
# s.sum(level = 1)
s.groupby(level=1).sum() # level = 1 表示按照第二层索引分组 .sum()函数用于求和

# 这里表示求和的时候，按照第一层索引分组

0    1.277213
1    1.850288
2    2.462014
3    1.704161
4    1.451019
5    1.260554
6    1.201731
7    1.025021
8    1.579971
9    2.234016
dtype: float64

In [81]:
s.groupby(level=0, axis=0).sum()

A    4.569663
B    6.269978
C    5.206348
dtype: float64

In [72]:
s.loc[pd.IndexSlice['B']].sum() # 求第一层索引为 'B' 的和

6.269977784857613

变换索引

In [82]:
new = s.swaplevel(0,1)
new

0  A    0.573873
1  A    0.278328
2  A    0.826619
3  A    0.442468
4  A    0.247764
5  A    0.130689
6  A    0.252911
7  A    0.825639
8  A    0.433484
9  A    0.557887
0  B    0.500885
1  B    0.941853
2  B    0.785805
3  B    0.525425
4  B    0.254143
5  B    0.493856
6  B    0.870958
7  B    0.129079
8  B    0.924752
9  B    0.843222
0  C    0.202455
1  C    0.630107
2  C    0.849590
3  C    0.736269
4  C    0.949112
5  C    0.636009
6  C    0.077862
7  C    0.070303
8  C    0.221734
9  C    0.832908
dtype: float64